zahidul3/athan-clock/BOOSTXL-K350QVG-S1_GrlibExample_MSP432P401R/main.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/

/* DriverLib Includes */
#include "driverlib.h"

/* Standard Includes */
#include <stdlib.h>
#include <stdio.h>
#include <stdint.h>
#include <string.h>
#include <stdbool.h>

/* GrLib Includes */
#include "grlib.h"
#include "button.h"
#include "imageButton.h"
#include "radioButton.h"
#include "checkbox.h"
#include "LcdDriver/kitronix320x240x16_ssd2119_spi.h"
#include "images/images.h"
#include "touch_P401R.h"

#include "uart_debug.h"


//Touch screen context
touch_context g_sTouchContext;
Graphics_ImageButton primitiveButton;
Graphics_ImageButton imageButton;
Graphics_Button yesButton;
Graphics_Button noButton;

// Graphic library context
Graphics_Context g_sContext;

//Flag to know if a demo was run
bool g_ranDemo = false;

void Delay(uint16_t msec);
void boardInit(void);
void clockInit(void);
void initializeDemoButtons(void);
void drawMainMenu(void);
void runPrimitivesDemo(void);
void runImagesDemo(void);
void drawRestarDemo(void);

#define CC_INT_PORT         GPIO_PORT_P6
#define CC_INT_PIN          GPIO_PIN0

#define HEARTBEAT_PORT      GPIO_PORT_P1
#define HEARTBEAT_PIN       GPIO_PIN0

#define HEARTBEAT_PORT      GPIO_PORT_P1
#define HEARTBEAT_PIN       GPIO_PIN0

#define BUTTON1_PORT        GPIO_PORT_P1
#define BUTTON1_PIN         GPIO_PIN1

/* Application Defines */
#define SLAVE_ADDRESS_1     0x40
#define NUM_OF_RX_BYTES     4

#define NAMAZ_START_POS     40
#define NAMAZ_SPACING       40

#define NAMAZ_TIME_START_POS_X     140
#define NAMAZ_TIME_SIZE 5

typedef struct
{
    uint8_t   Second;
    uint8_t   Minute;
    uint8_t   Hour;
    uint8_t   Day;
    uint8_t   Month;
    uint8_t   Year;
    uint8_t   DayOfWeek;  // 0-6, where 0 = Sunday
    int8_t   TimeZone;   //
} TsDateTime;

typedef enum {
  FAJR = 0,
  SUNRISE,
  ZUHR,
  ASR,
  MAGHRIB,
  ISHA,
  NUMBER_OF_ATHAN,
  CURRENT_TIME = 0xFF
} athan_type;

typedef struct
{
    athan_type athanType;
    uint8_t   Hour;
    uint8_t   Minute;
} TsAthanTime;

typedef struct
{
    athan_type athanType;
    uint8_t   Hour;
    uint8_t   Minute;
} TsCurrentTime;

typedef struct
{
    TsAthanTime athanTimes[NUMBER_OF_ATHAN];
} TsAthanTimesDay;

TsDateTime currentDateTime =
        {
         0, //sec
         48, //min
         12, //hour
         7, //day
         5, //month
         19,//year
         2, //dayOfWeek 0-6, where 0 = Sunday
         0 //zone
        };

TsAthanTimesDay currentAthanTimesDay = {0};

uint8_t rxBuffer[20] = {0};

const eUSCI_UART_Config uartConfig =
{
        EUSCI_A_UART_CLOCKSOURCE_ACLK,          // SMCLK Clock Source
        13,                                     // BRDIV = 78
        0,                                       // UCxBRF = 2
        3,                                       // UCxBRS = 0
        EUSCI_A_UART_NO_PARITY,                  // No Parity
        EUSCI_A_UART_LSB_FIRST,                  // LSB First
        EUSCI_A_UART_ONE_STOP_BIT,               // One stop bit
        EUSCI_A_UART_MODE,                       // UART mode
        EUSCI_A_UART_LOW_FREQUENCY_BAUDRATE_GENERATION  // Oversampling
};


/******************************************************************************
 * The USCI_B0 data ISR RX vector is used to move received data from the I2C
 * master to the MSP432 memory.
 ******************************************************************************/
void EUSCIB0_IRQHandler(void)
{
    uint_fast16_t status;
    uint_fast8_t data;

    status = MAP_I2C_getEnabledInterruptStatus(EUSCI_B0_BASE);
    MAP_I2C_clearInterruptFlag(EUSCI_B0_BASE, status);

    /* RXIFG for Slave Address 1*/
    if (status & EUSCI_B_I2C_START_INTERRUPT)
    {
        MAP_I2C_enableInterrupt(EUSCI_B0_BASE, EUSCI_B_I2C_RECEIVE_INTERRUPT0);
    }
    else if (status & EUSCI_B_I2C_RECEIVE_INTERRUPT0)
    {
        data = MAP_I2C_slaveGetData(EUSCI_B0_BASE);
        Graphics_drawString(&g_sContext, "I2C Received", NAMAZ_TIME_SIZE, NAMAZ_TIME_START_POS_X, NAMAZ_START_POS+NAMAZ_SPACING*6, TRANSPARENT_TEXT);
    }
}

static uint32_t index = 0;

typedef enum UARTLCDstate{
    UART_LCD_IDLE,
    UART_FINISH_CURRENT_TIME,
    UART_FINISH_ATHAN_TIME,
    UART_RECEIVING_ATHAN_TIME,
    UART_RECEIVING_CURRENT_TIME
} UARTLCDSTATE;

UARTLCDSTATE UartLcdState = UART_LCD_IDLE;

uint8_t CurrentHour;
uint8_t CurrentMinute;

void setCurrentTime12Hr(TsDateTime dateTime)
{
    //convert to 12 hr format
    if(dateTime.Hour>12)
    {
        dateTime.Hour -= 12;
    }
    else if(dateTime.Hour==0)
    {
        dateTime.Hour = 12;
    }
    CurrentHour = dateTime.Hour;
    CurrentMinute = dateTime.Minute;
}

