zahidul3/athan-clock/BOOSTXL-K350QVG-S1_GrlibExample_MSP432P401R/main.c
char buffer[10];

/* EUSCI A0 UART ISR - Echoes data back to PC host */
void EUSCIA2_IRQHandler(void)
{
    uint32_t status = MAP_UART_getEnabledInterruptStatus(EUSCI_A2_BASE);

    MAP_UART_clearInterruptFlag(EUSCI_A2_BASE, status);

    if(status & EUSCI_A_UART_RECEIVE_INTERRUPT_FLAG)
    {
        if(UartLcdState <= UART_FINISH_ATHAN_TIME)
            index = 0;


        rxBuffer[index] = MAP_UART_receiveData(EUSCI_A2_BASE);
        //MAP_UART_transmitData(EUSCI_A0_BASE, rxBuffer[index]);
        if(rxBuffer[index] == CURRENT_TIME && UartLcdState <= UART_FINISH_ATHAN_TIME && index == 0)
            UartLcdState = UART_RECEIVING_CURRENT_TIME;
        else if(rxBuffer[index] == FAJR && index == 0)
            UartLcdState = UART_RECEIVING_ATHAN_TIME;

        index++;

        if(index >= sizeof(TsCurrentTime) && UartLcdState == UART_RECEIVING_CURRENT_TIME)
        {
            CurrentHour = rxBuffer[1];
            CurrentMinute = rxBuffer[2];

            memset(buffer, 0, 10);
            ltoa(CurrentHour,buffer);
            uint8_t strLen = strlen(buffer);
            buffer[strLen] = ':';
            ltoa(CurrentMinute,(buffer+strLen+1));
            printDebug("Received current time: ");
            printDebug(buffer);
            printDebug("\n\r");
            //GPIO_toggleOutputOnPin(HEARTBEAT_PORT, HEARTBEAT_PIN);


            //setCurrentTime12Hr(currentDateTime);
            drawMainMenu();
            UartLcdState = UART_FINISH_CURRENT_TIME;
            index = 0;
            //memcpy(&currentAthanTimesDay.athanTimes[0].athanType, rxBuffer, sizeof(currentAthanTimesDay));
        }

        if(index >= sizeof(currentAthanTimesDay) && UartLcdState == UART_RECEIVING_ATHAN_TIME) //18
        {
            memcpy(&currentAthanTimesDay.athanTimes[0].athanType, rxBuffer, sizeof(currentAthanTimesDay));
            g_ranDemo = true;
            printDebug("Received athan time\n\r");
            drawMainMenu();
            UartLcdState = UART_FINISH_ATHAN_TIME;
            index = 0;
        }
    }
}

void initUART(void)
{
    /* Selecting P3.2/PM_UCA2RXD/PM_UCA2SOMI and P3.3/PM_UCA2TXD/PM_UCA2SIMO in UART mode */
    MAP_GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P3,
            GPIO_PIN2 | GPIO_PIN3, GPIO_PRIMARY_MODULE_FUNCTION);

    //![Simple UART Example]
    /* Configuring UART Module */
    MAP_UART_initModule(EUSCI_A2_BASE, &uartConfig);

    /* Enable UART module */
    MAP_UART_enableModule(EUSCI_A2_BASE);

    /* Enabling interrupts */
    MAP_UART_enableInterrupt(EUSCI_A2_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT);
    MAP_Interrupt_enableInterrupt(INT_EUSCIA2);
}



void buttonIntHandler(void)
{
    GPIO_clearInterruptFlag(BUTTON1_PORT, BUTTON1_PIN);

    printDebug("Button Pressed!\n\r");
    GPIO_toggleOutputOnPin(CC_INT_PORT, CC_INT_PIN);

    MAP_UART_transmitData(EUSCI_A2_BASE, 'I');
}

uint32_t sysTickCount = 0;
/*
 * SysTick interrupt handler. This handler toggles HEARTBEAT LED on/off.
 */
void SysTick_Handler(void)
{
    sysTickCount++;
    GPIO_toggleOutputOnPin(HEARTBEAT_PORT, HEARTBEAT_PIN);
}

uint16_t xSum, ySum;

void main(void)
 {
//  int16_t ulIdx;
    WDT_A_hold(__WDT_A_BASE__);
    MAP_Interrupt_disableMaster();

    /* Initialize the demo. */
    boardInit();
    clockInit();
    initializeDemoButtons();

    //
    // Configure the pins that connect to the LCD as GPIO outputs.
    //
    GPIO_setAsOutputPin(CC_INT_PORT, CC_INT_PIN);
    GPIO_setOutputLowOnPin(CC_INT_PORT, CC_INT_PIN);

    GPIO_setAsOutputPin(HEARTBEAT_PORT, HEARTBEAT_PIN);
    GPIO_setOutputLowOnPin(HEARTBEAT_PORT, HEARTBEAT_PIN);

    GPIO_toggleOutputOnPin(HEARTBEAT_PORT, HEARTBEAT_PIN);

    //setup S1 Left Button GPIO
    GPIO_setAsInputPinWithPullUpResistor(BUTTON1_PORT, BUTTON1_PIN);
    MAP_GPIO_clearInterruptFlag(GPIO_PORT_P1, GPIO_PIN1);
    GPIO_interruptEdgeSelect(BUTTON1_PORT, BUTTON1_PIN, GPIO_HIGH_TO_LOW_TRANSITION);
    GPIO_registerInterrupt(BUTTON1_PORT, buttonIntHandler);
    GPIO_enableInterrupt(BUTTON1_PORT, BUTTON1_PIN);

    MAP_SysTick_setPeriod(12000000);
    MAP_SysTick_enableModule();

    initUART();         //9600baud 8N1
    initUART0Debug();   //921600baud 8N1

    //MAP_Interrupt_enableSleepOnIsrExit();
    MAP_Interrupt_enableMaster();

    /* Globally enable interrupts. */
    __enable_interrupt();
    MAP_SysTick_enableInterrupt();

    // LCD setup using Graphics Library API calls
    Kitronix320x240x16_SSD2119Init();
    Graphics_initContext(&g_sContext, &g_sKitronix320x240x16_SSD2119);
    Graphics_setBackgroundColor(&g_sContext, GRAPHICS_COLOR_BLACK);
    Graphics_setFont(&g_sContext, &g_sFontCmss36b);
    Graphics_clearDisplay(&g_sContext);

    touch_initInterface();

    drawMainMenu();

    printDebug("Hello World!\n\r");

    //while(1)
    //{
    //    MAP_PCM_gotoLPM0();
    //}

    // Loop to detect touch
    while(1)
    {
        /* Wait for a tocuh to be detected and wait ~4ms. */
        while(!touch_detectedTouch())
        {
            ;
        }
        touch_delay();

        /* Sample the X and Y measurements of the touch screen. */
        xSum = touch_sampleX();
        ySum = touch_sampleY();

        printDebug("Touched!\n\r");
        //touch_updateCurrentTouch(&g_sTouchContext);

//        if(g_ranDemo == true)
//        {
//            g_ranDemo = false;
//            drawMainMenu();
//        }

//        if( g_sTouchContext.touch)
//        {
//            if(Graphics_isImageButtonSelected(&primitiveButton, g_sTouchContext.x,  g_sTouchContext.y)){
//                Graphics_drawSelectedImageButton(&g_sContext,&primitiveButton);
//                runPrimitivesDemo();
//            }else if (Graphics_isImageButtonSelected(&imageButton, g_sTouchContext.x,  g_sTouchContext.y)){
//                Graphics_drawSelectedImageButton(&g_sContext,&imageButton);
//                runImagesDemo();
//            }
//
//            if(g_ranDemo == true)
//            {
//                g_ranDemo = false;
//                drawMainMenu();
//            }
//        }
    }

